ht32-holtek/HT32_STD_7xxxx_FWLib/project_template/IP/Template_USB/system_ht32f7xxxx_01.c
/* Check FLASH wait-state setting                                                                           */
#if ((__CK_AHB > WS1_CLK) && (WAIT_STATE < 2) || \
     (__CK_AHB > WS0_CLK) && (WAIT_STATE < 1))
  #error "FLASH wait state configuration issue!"
#endif
/**
  * @}
  */

/** @addtogroup HT32F7xxxx_System_Private_Variables
  * @{
  */
__IO uint32_t SystemCoreClock = __CK_AHB;   /*!< SystemCoreClock = CK_AHB                                   */
/**
  * @}
  */

/** @addtogroup HT32F7xxxx_System_Private_Functions
  * @{
  */

/**
  * @brief  Setup the microcontroller system.
  *         Initializes the system clocks and the embedded Flash.
  * @note   This function should be used after reset.
  * @retval None
  */
void SystemInit(void)
{
#if (WDT_ENABLE == 1)
  HT_CKCU->APBCCR1 |= (1UL << 4);
  HT_WDT->PR = 0x35CA;
  HT_WDT->MR0 = 0;
  HT_WDT->MR1 = ((HT_WDT->MR1 & 0xFFF) | (WDT_PRESCALER << 12));
  HT_WDT->MR0 = WDT_RELOAD | (WDT_RESET_ENABLE << 13) | (WDT_SLEEP_HALT << 14) | (1UL << 16);
  HT_WDT->CR = 0x5FA00001;
#else
  #if (DEINIT_ENABLE == 1)
  HT_RSTCU->APBPRST1 = (1 << 4);
  #endif
#endif

  SetBit_BB((u32)(&HT_CKCU->APBCCR1), 6);                       /* enable Backup domain register clock      */

  ResetBit_BB((u32)(&HT_PWRCU->CR), 4);                         /* set LDO output voltage to level 0 (1.2V) */
  ResetBit_BB((u32)(&HT_PWRCU->CR), 5);

#if (DEINIT_ENABLE == 1)
  /* De-init the setting                                                                                    */
  HT_CKCU->AHBCCR &= ~(3UL << 10);                              /* disable IP who may use PLL as source     */
  SetBit_BB((u32)(&HT_CKCU->GCCR), 11);                         /* enable HSI                               */
  while (!GetBit_BB((u32)(&HT_CKCU->GCSR), 3)){};               /* wait for HSI ready                       */
  HT_CKCU->GCCR = ((HT_CKCU->GCCR & ~7UL) | 3UL);               /* select CK_SYS source                     */
  while ((HT_CKCU->CKST & 7UL) != 3UL){};                       /* wait for clock switch complete           */
  HT_FLASH->WSCR = (((HT_FLASH->WSCR) & ~15UL) | 1UL);          /* set Wait State as 0 WS                   */
  HT_CKCU->AHBCFGR = 0;                                         /* set CK_AHB prescaler                     */
  ResetBit_BB((u32)(&HT_CKCU->GCCR), 9);                        /* disable PLL                              */
  SetBit_BB((u32)(&HT_CKCU->GCFGR), 8);                         /* select PLL source as HSI                 */
  ResetBit_BB((u32)(&HT_CKCU->GCCR), 3);                        /* disable USB PLL                          */
  SetBit_BB((u32)(&HT_CKCU->GCFGR), 9);                         /* select USB PLL source as HSI             */
#endif

  /* HSE initiation                                                                                         */
#if (HSE_ENABLE == 1)
  SetBit_BB((u32)(&HT_CKCU->GCCR), 10);                         /* enable HSE                               */
  while (!GetBit_BB((u32)(&HT_CKCU->GCSR), 2)){};               /* wait for HSE ready                       */
#endif

  /* LSE initiation                                                                                         */
#if (LSE_ENABLE == 1)
  do {
    SetBit_BB((u32)(&HT_RTC->CR), 3);                           /* enable LSE                               */
  } while (!GetBit_BB((u32)(&HT_RTC->CR), 3));
  #if (LSE_WAIT_READY == 1)
  while (!GetBit_BB((u32)(&HT_CKCU->GCSR), 4)){};               /* wait for LSE ready                       */
  #endif
#endif

  ResetBit_BB((u32)(&HT_CKCU->APBCCR1), 6);                     /* disable Backup domain register clock     */

  /* LSI initiation                                                                                         */
#if (HCLK_SRC == 7)
  while (!GetBit_BB((u32)(&HT_CKCU->GCSR), 5)){};               /* wait for LSI ready                       */
#endif

  /* PLL initiation                                                                                         */
#if (PLL_ENABLE == 1)
  HT_CKCU->PLLCFGR = ((PLL_NF2_DIV & 15UL) << 23) | (PLL_NO2_DIV << 21);  /* set PLL divider                */

  #if (PLL_CLK_SRC_DIV == 1)
    SetBit_BB((u32)(&HT_CKCU->PLLCFGR), 28);                    /* set PLL clock source divider             */
  #else
    ResetBit_BB((u32)(&HT_CKCU->PLLCFGR), 28);                  /* reset PLL clock source divider           */
  #endif

  #if (PLL_CLK_SRC == 0)
    ResetBit_BB((u32)(&HT_CKCU->GCFGR), 8);                     /* select PLL source as HSE                 */
  #else
    SetBit_BB((u32)(&HT_CKCU->GCFGR), 8);                       /* select PLL source as HSI                 */
  #endif

  SetBit_BB((u32)(&HT_CKCU->GCCR), 9);                          /* enable PLL                               */
  while (!GetBit_BB((u32)(&HT_CKCU->GCSR), 1)){};               /* wait for PLL ready                       */
#endif

  /* FLASH initiation                                                                                       */
#if (WAIT_STATE == 9)
  #if (__CK_AHB > WS1_CLK)
    HT_FLASH->WSCR = (HT_FLASH->WSCR & ~15UL) | 3UL;            /* auto-select wait state                   */
  #elif (__CK_AHB > WS0_CLK)
    HT_FLASH->WSCR = (HT_FLASH->WSCR & ~15UL) | 2UL;            /* auto-select wait state                   */
  #endif
#else
  HT_FLASH->WSCR = (HT_FLASH->WSCR & ~15UL) | (WAIT_STATE + 1); /* manual assign wait state                 */
#endif

  /* CK_AHB initiation                                                                                      */
#if (HCLK_DIV != 0)
  HT_CKCU->AHBCFGR = HCLK_DIV;                                  /* set CK_AHB prescaler                     */
#endif

  /* CK_SYS initiation                                                                                      */
#if (HCLK_SRC != 3)
  HT_CKCU->GCCR = ((HT_CKCU->GCCR & ~7UL) | HCLK_SRC);          /* select CK_SYS source                     */
  while ((HT_CKCU->CKST & 7UL) != HCLK_SRC){};                  /* wait for clock switch complete           */
#endif

  /* Cache configuration                                                                                    */
#if (CACHE_ENABLE == 1)
  SetBit_BB((u32)(&HT_FLASH->CCR), 0);                          /* 0: cache disable, 1: cache enable        */
  while (HT_FLASH->SR != 0x00000012);
#else
  ResetBit_BB((u32)(&HT_FLASH->CCR), 0);                        /* 0: cache disable, 1: cache enable        */
  while ((HT_FLASH->SR & 3) != 0);
#endif

  /* RAM ECC configuration                                                                                  */
#if defined(USE_HT32F72368_78_88)
  SetBit_BB((u32)(&HT_CKCU->APBCCR1), 6);                       /* Enable Backup domain register clock      */
  if(HT_SYSTEM->RAMCR & 0x00000001)
  {
    if(HT_PWRCU->SR & 0x00000003)
    {
      HT_SYSTEM->RAMCR  = 0x7AC50000;                           /* Disable Write Protection                 */
      HT_SYSTEM->RAMCR  |= 0x00000010;                          /* RAM Erase                                */
      while(HT_SYSTEM->RAMCR & 0x00000010){};                   /* Wait for SRAM Erase                      */
    }
  }
  ResetBit_BB((u32)(&HT_CKCU->APBCCR1), 6);                     /* Disable Backup domain register clock     */
  #if (RAMECC_INTERRUPT != 0)
    HT_SYSTEM->RAMISR = 0x00000003;                             /* Clear RAM ECC interrupt flag             */

