ht32-holtek/HT32_STD_7xxxx_FWLib/project_template/IP/Template_USB/system_ht32f7xxxx_01.c
    #if (RAMECC_INTERRUPT == 1)
     HT_SYSTEM->RAMICR = 0x00000003;                            /* Config the FLASH interrupt               */
    #endif

    #if (RAMECC_INTERRUPT == 2)
      HT_SYSTEM->RAMICR = 0x00000007;                           /* Config the NMI and FLASH interrupt       */
    #endif

    NVIC_EnableIRQ(FLASH_IRQn);                                 /* Enable FLASH NVIC vector                 */  
  #endif
#endif

  /* HSE power down                                                                                         */
#if ((HSE_ENABLE == 0) && (HCLK_SRC != 2) && ((PLL_ENABLE == 0) || (PLL_CLK_SRC == 1)))
  ResetBit_BB((u32)(&HT_CKCU->GCCR), 10);
#endif

  /* HSI power down                                                                                         */
#if ((HSI_ENABLE == 0) && (HCLK_SRC != 3) && ((PLL_ENABLE == 0) || (PLL_CLK_SRC == 0)))
  ResetBit_BB((u32)(&HT_CKCU->GCCR), 11);
#endif
}

/**
  * @brief  Update SystemCoreClock
  * @retval None
  */
void SystemCoreClockUpdate(void)
{
  u32 SystemCoreClockDiv = HT_CKCU->AHBCFGR & 7UL;
  u32 PllSourceClockDiv = (HT_CKCU->PLLCFGR >> 28) & 1UL;
  u32 PllFeedbackClockDiv = (((HT_CKCU->PLLCFGR >> 23) & 15UL) == 0) ? (16) : ((HT_CKCU->PLLCFGR >> 23) & 15UL);
  u32 PllOutputClockDiv = (HT_CKCU->PLLCFGR >> 21) & 3UL;
  u32 SystemCoreClockSrc = HT_CKCU->CKST & 7UL;

  /* Get system core clock according to global clock control & configuration registers                      */
  if (SystemCoreClockSrc == 1)
  {
    if (GetBit_BB((u32)(&HT_CKCU->PLLCR), 31))
    {
      PllFeedbackClockDiv = 1;
      PllOutputClockDiv = 0;
    }

    if (GetBit_BB((u32)(&HT_CKCU->GCFGR), 8))
    {
      SystemCoreClock = (((HSI_VALUE >> PllSourceClockDiv) * PllFeedbackClockDiv) >> PllOutputClockDiv) >> SystemCoreClockDiv;
    }
    else
    {
      SystemCoreClock = (((HSE_VALUE >> PllSourceClockDiv) * PllFeedbackClockDiv) >> PllOutputClockDiv) >> SystemCoreClockDiv;
    }
  }
  else if (SystemCoreClockSrc == 2)
  {
    SystemCoreClock = HSE_VALUE >> SystemCoreClockDiv;
  }
  else if (SystemCoreClockSrc == 3)
  {
    SystemCoreClock = HSI_VALUE >> SystemCoreClockDiv;
  }
  else if (SystemCoreClockSrc == 6)
  {
    SystemCoreClock = LSE_VALUE >> SystemCoreClockDiv;
  }
  else if (SystemCoreClockSrc == 7)
  {
    SystemCoreClock = LSI_VALUE >> SystemCoreClockDiv;
  }
}

#if (RAMECC_NMI_HANDLER_OVER_WRITE_BY_IT == 0)
#if (RAMECC_INTERRUPT == 2)
/**
  * @brief  This function handles NMI exception.
  * @retval None
  */
void NMI_Handler(void)
{
  /* Double Error Bit Handling Routine                                                                      */
  if(RAMECC_GET_DOUBLE_INT_STATUS())
  {
    while(1)
    {
    }
  }
}
#endif
#endif
#if (RAMECC_FLASH_HANDLER_OVER_WRITE_BY_IT == 0)
#if (RAMECC_INTERRUPT != 0)
/**
  * @brief  This function handles Flash interrupt.
  * @retval None
  */
u32 gSingleErrAddress;
void FLASH_IRQHandler(void)
{
  /* Double Error Bit Handling Routine                                                                      */
  /* !!! NOTICE !!! 
     Process Double Error Bit Handling Routine in order, followed by Single Error Bit Handling Routine.
  */
  if(RAMECC_GET_DOUBLE_INT_STATUS())
  {
    while(1)
    {
    }
  }

  /* Single Error Bit Handling Routine                                                                      */
  if(RAMECC_GET_SINGLE_INT_STATUS())
  {
    gSingleErrAddress = RAMECC_CorrectSingleAddrVal();
  }
}
#endif
#endif

/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */

/******************* (C) COPYRIGHT Holtek Semiconductor Inc. *****END OF FILE***                            */
